updated installation description
